validationAndVerificationSuite/verification/incompressible/simpleFoam/consistencyTest/cavity/TemplateCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-15;
        relTol           0;
    };

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-15;
        relTol           0;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p 1e-14;
        U 1e-14;
    }
}

relaxationFactors
{
    fields
    {
        p pRelaxFactor;
    }
    equations
    {
        U URelaxFactor;
    }
}


// ************************************************************************* //
